app/controllers/lineitems_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
INSERT INTO "lineitems" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 31], ["cart_id", 26], ["created_at", "2017-12-01 19:58:37.843336"], ["updated_at", "2017-12-01 19:58:37.843336"]]
UPDATE "lineitems" SET "quantity" = ?, "updated_at" = ? WHERE "lineitems"."id" = ?  [["quantity", 2], ["updated_at", "2017-12-01 19:58:38.348682"], ["id", 46]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_item(product.id)

    #@line_item = LineItem.new(line_item_params)

    respond_to do |format|
      if @line_item.save