app/controllers/search_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."name" ASC
---
  def index
    @products = Product.all
    if params[:search]
      @products = Product.search(params[:search]).order(:name)